# BuiltInFailures.ElementTypeFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElementTypeFailures Class
BuiltInFailures Class Members See Also
---
Failures about ElementTypeFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ElementTypeFailures
```

Visual Basic
---
```text
Public NotInheritable Class ElementTypeFailures
```

Visual C++
---
```text
public ref class ElementTypeFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ElementTypeFailures
# See Also
BuiltInFailures..::..ElementTypeFailures Members
Autodesk.Revit.DB Namespace